## Based recommandation system

In [91]:
import os
import numpy as np
import pandas as pd

In [92]:
movies_names = pd.read_csv("data/movies.csv")
movies_names.head(5)

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [93]:
ratings_data= pd.read_csv("data/ratings.csv")
ratings_data.head(5)

   userId  movieId  rating   timestamp
0       1       31     2.5  1260759144
1       1     1029     3.0  1260759179
2       1     1061     3.0  1260759182
3       1     1129     2.0  1260759185
4       1     1172     4.0  1260759205

In [94]:
movie_data =  pd.merge(ratings_data , movies_names , on= 'movieId')
movie_data.head(5)

   userId  movieId  rating   timestamp                   title genres
0       1       31     2.5  1260759144  Dangerous Minds (1995)  Drama
1       7       31     3.0   851868750  Dangerous Minds (1995)  Drama
2      31       31     4.0  1273541953  Dangerous Minds (1995)  Drama
3      32       31     4.0   834828440  Dangerous Minds (1995)  Drama
4      36       31     3.0   847057202  Dangerous Minds (1995)  Drama

## Critères de recommandation 
##### 1- film avec le plus d'avis
##### 2- nombre de vues

## Moyenne des avis de films

In [95]:
movie_data.groupby('title')['rating'].mean().head()

title
"Great Performances" Cats (1998)           1.750000
$9.99 (2008)                               3.833333
'Hellboy': The Seeds of Creation (2004)    2.000000
'Neath the Arizona Skies (1934)            0.500000
'Round Midnight (1986)                     2.250000
Name: rating, dtype: float64

In [96]:
movie_data.groupby('title')['rating'].mean().sort_values(ascending=False).head(10)

title
Ivan Vasilievich: Back to the Future (Ivan Vasilievich menyaet professiyu) (1973)    5.0
Alien Escape (1995)                                                                  5.0
Boiling Point (1993)                                                                 5.0
Bone Tomahawk (2015)                                                                 5.0
Borgman (2013)                                                                       5.0
Survive and Advance (2013)                                                           5.0
Supercop 2 (Project S) (Chao ji ji hua) (1993)                                       5.0
Last Dragon, The (1985)                                                              5.0
Boy Crazy (2009)                                                                     5.0
Brandon Teena Story, The (1998)                                                      5.0
Name: rating, dtype: float64

## comptage de film

In [97]:
movie_data.groupby('title')['rating'].count().sort_values(ascending=False).head(10)

title
Forrest Gump (1994)                          341
Pulp Fiction (1994)                          324
Shawshank Redemption, The (1994)             311
Silence of the Lambs, The (1991)             304
Star Wars: Episode IV - A New Hope (1977)    291
Jurassic Park (1993)                         274
Matrix, The (1999)                           259
Toy Story (1995)                             247
Schindler's List (1993)                      244
Terminator 2: Judgment Day (1991)            237
Name: rating, dtype: int64

### Ajout du comptage des films a notre table

In [98]:
movie_data[['title', 'rating']]

                                       title  rating
0                     Dangerous Minds (1995)     2.5
1                     Dangerous Minds (1995)     3.0
2                     Dangerous Minds (1995)     4.0
3                     Dangerous Minds (1995)     4.0
4                     Dangerous Minds (1995)     3.0
...                                      ...     ...
99999               War of the Worlds (2005)     2.5
100000                       Box, The (2009)     3.5
100001                 Pie in the Sky (1996)     3.0
100002                   Summer Catch (2001)     1.0
100003  6th Man, The (Sixth Man, The) (1997)     1.0

[100004 rows x 2 columns]

#### calcul de la moyenne des avis

In [99]:
ratings_mean_count = pd.DataFrame(movie_data.groupby('title')['rating'].mean())
ratings_mean_count

                                             rating
title
"Great Performances" Cats (1998)           1.750000
$9.99 (2008)                               3.833333
'Hellboy': The Seeds of Creation (2004)    2.000000
'Neath the Arizona Skies (1934)            0.500000
'Round Midnight (1986)                     2.250000
...                                             ...
xXx (2002)                                 2.478261
xXx: State of the Union (2005)             1.000000
¡Three Amigos! (1986)                      3.258065
À nous la liberté (Freedom for Us) (1931)  4.500000
İtirazım Var (2014)                        3.500000

[9064 rows x 1 columns]

##### Calcul du nombre d'évaluations et la note moyenne ci-dessus

In [100]:
ratings_mean_count['rating_counts'] = pd.DataFrame(movie_data.groupby('title')['rating'].count())

In [101]:
ratings_mean_count.head(5)

                                           rating  rating_counts
title
"Great Performances" Cats (1998)         1.750000              2
$9.99 (2008)                             3.833333              3
'Hellboy': The Seeds of Creation (2004)  2.000000              1
'Neath the Arizona Skies (1934)          0.500000              1
'Round Midnight (1986)                   2.250000              2

In [102]:
ratings_mean_count['rating'] = round(ratings_mean_count['rating'], 1) #arondir a un chiffre apres la virgule

In [103]:
ratings_mean_count.head(5)

                                         rating  rating_counts
title
"Great Performances" Cats (1998)            1.8              2
$9.99 (2008)                                3.8              3
'Hellboy': The Seeds of Creation (2004)     2.0              1
'Neath the Arizona Skies (1934)             0.5              1
'Round Midnight (1986)                      2.2              2

In [104]:
ratings_mean_count =  ratings_mean_count[(ratings_mean_count['rating']> 3 ) & (ratings_mean_count['rating_counts']>100)]
ratings_mean_count

                                            rating  rating_counts
title
2001: A Space Odyssey (1968)                   3.9            123
Airplane! (1980)                               3.8            106
Aladdin (1992)                                 3.7            215
Alien (1979)                                   4.0            127
Aliens (1986)                                  3.9            125
...                                            ...            ...
While You Were Sleeping (1995)                 3.4            101
Who Framed Roger Rabbit? (1988)                3.7            108
Willy Wonka & the Chocolate Factory (1971)     3.8            148
Wizard of Oz, The (1939)                       4.0            117
X-Men (2000)                                   3.6            127

[145 rows x 2 columns]

In [105]:
ratings_mean_count = ratings_mean_count.sort_values(by = "rating" , ascending=False).head(10)
ratings_mean_count

                                                    rating  rating_counts
title
Godfather, The (1972)                                  4.5            200
Shawshank Redemption, The (1994)                       4.5            311
Usual Suspects, The (1995)                             4.4            201
Godfather: Part II, The (1974)                         4.4            135
Pulp Fiction (1994)                                    4.3            324
Fargo (1996)                                           4.3            224
One Flew Over the Cuckoo's Nest (1975)                 4.3            144
Schindler's List (1993)                                4.3            244
Taxi Driver (1976)                                     4.2            118
Lord of the Rings: The Fellowship of the Ring, ...     4.2            200

#### calcul de la similarité cosinus en python

In [106]:
from math import*
def square_rooted(x):
    return round(sqrt(sum([a*a for a in x])), 3)
def cosine_similarity(x,y):
    numerator =  sum(a*b for a,b in zip(x,y))
    denominator = square_rooted(x)*square_rooted(y)
    return round(numerator/float(denominator), 3)

In [107]:
print(cosine_similarity([3,45,7,2],[2,54,13,15]))

0.972

In [108]:
#Autre methode pour calculer

# Vecteurs a et b
a = np.array([3, 45, 7, 2])
b = np.array([2, 54, 13, 15])

# Calcul de la similarité cosinus
dot_product = np.dot(a, b)
norm_a = np.linalg.norm(a)
norm_b = np.linalg.norm(b)
cosine_similarity =round(( dot_product / (norm_a * norm_b)),3)

cosine_similarity

0.972

In [109]:
from sklearn.feature_extraction.text import TfidfVectorizer
from sklearn.metrics.pairwise import cosine_similarity

# Deux phrases à comparer
sentence1 = "La maison est jolie et grande."
sentence2 = "La grande maison est très jolie."

# Prétraitement et conversion en vecteurs TF-IDF
vectorizer = TfidfVectorizer()
tfidf_matrix = vectorizer.fit_transform([sentence1, sentence2])

# Calcul de la similarité cosinus
cosine_sim = cosine_similarity(tfidf_matrix[0:1], tfidf_matrix[1:2])

cosine_sim[0][0]

0.7168117414430619

In [110]:
from sklearn.feature_extraction.text import CountVectorizer

pd.set_option('display.max_columns',100)
df= pd.read_csv('https://query.data.world/s/uikepcpffyo2nhig52xxeevdialfl7')
#df.head()

In [111]:
df.shape

(250, 38)

#### On va se servir du titre , du genre , du directeur , des acteurs et du resumé pour sortir des recommandations

In [112]:
df = df [['Title', 'Genre' , 'Director', 'Actors' , 'Plot']]
df.head()

,Title,Genre,Director,Actors,Plot
0,The Shawshank Redemption,"Crime, Drama",Frank Darabont,"Tim Robbins, Morgan Freeman, Bob Gunton, Willi...",Two imprisoned men bond over a number of years...
1,The Godfather,"Crime, Drama",Francis Ford Coppola,"Marlon Brando, Al Pacino, James Caan, Richard ...",The aging patriarch of an organized crime dyna...
2,The Godfather: Part II,"Crime, Drama",Francis Ford Coppola,"Al Pacino, Robert Duvall, Diane Keaton, Robert...",The early life and career of Vito Corleone in ...
3,The Dark Knight,"Action, Crime, Drama",Christopher Nolan,"Christian Bale, Heath Ledger, Aaron Eckhart, M...",When the menace known as the Joker emerges fro...
4,12 Angry Men,"Crime, Drama",Sidney Lumet,"Martin Balsam, John Fiedler, Lee J. Cobb, E.G....",A jury holdout attempts to prevent a miscarria...

In [113]:
# Enlever les virgules entre les noms complets des acteurs et ne conserver que les trois premiers noms

df['Actors'] = df['Actors'].map(lambda x: x.split(',')[:3])

In [114]:
#mettre les genres dans une liste de mots
df['Genre'] = df['Genre'].map(lambda x: x.lower().split(','))

In [115]:
df['Director']= df['Director'].map(lambda x: x.split(' '))

In [116]:
for index , df in df.iterrows():
    df['Actors'] = [x.lower().replace(' ', '') for x in df['Actors']]
    df['Director'] = ''.join(df['Director']).lower()

In [117]:
df['Actors']

['devpatel', 'saurabhshukla', 'anilkapoor']

In [118]:
df.head()

Title                                     Slumdog Millionaire
Genre                                                 [drama]
Director                             dannyboyleloveleentandan
Actors                  [devpatel, saurabhshukla, anilkapoor]
Plot        A Mumbai teen reflects on his upbringing in th...
Name: 249, dtype: object

In [119]:
import rake_nltk
from rake_nltk import Rake
import nltk
nltk.download('stopwords')
nltk.download('punkt')

df['Key_words']= ""

for index , df in df.iterrows():
    plot =  df['Plot']
    r = Rake()
    r.extract_keywords_from_text(plot)
    key_words_dict_scores= r.get_word_degrees()
    df['Key_words']= list(key_words_dict_scores.keys())

df.drop(columns = ['Plot'] , inplace =  True)

[nltk_data] Downloading package stopwords to
[nltk_data]     C:\Users\gaetanyossa\AppData\Roaming\nltk_data...
[nltk_data]   Package stopwords is already up-to-date!
[nltk_data] Downloading package punkt to
[nltk_data]     C:\Users\gaetanyossa\AppData\Roaming\nltk_data...
[nltk_data]   Package punkt is already up-to-date!

AttributeError: 'Series' object has no attribute 'iterrows'

In [ ]:
key_words_dict_scores

defaultdict(<function rake_nltk.rake.Rake._build_word_co_occurance_graph.<locals>.<lambda>()>,
            {'mumbai': 3,
             'teen': 3,
             'reflects': 3,
             'upbringing': 1,
             'slums': 1,
             'accused': 1,
             'cheating': 1,
             'indian': 2,
             'version': 2,
             'wants': 1,
             'millionaire': 2,
             '?"': 2})

In [ ]:
df['Key_words']

['mumbai',
 'teen',
 'reflects',
 'upbringing',
 'slums',
 'accused',
 'cheating',
 'indian',
 'version',
 'wants',
 'millionaire',
 '?"']